_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_НаборКонстантпоМетодике1984.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_НаборКонстантпоМетодике1984</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоэффициентТРвНР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентОЗвНР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СметнаяПрибыльБазисноИндексная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НакладныеРасходыРесурсные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СметнаяПрибыльРесурсная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НРБазисныеОтФОТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НРТекущиеОтФОТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СПБазисныеОтФОТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СПТекущиеОтФОТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентПереходаОтОЗкЗТРмонтажные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентПереходаОтОЗкЗТР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентПереходаОтЗМкЗТМЗемляные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентПереходаОтЗМкЗТМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_НастройкиВерсионированияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_НастройкиВерсионированияОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛогинSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПарольSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьПриЗаписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьПриИзмененииПодчиненных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьПриПересчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьПриУтверждении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьРегламентно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокХраненияВерсий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СрокиХраненияВерсий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранитьВоВнешнейБазе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/СМ_Ресурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>СМ_Ресурсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРесурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ВидыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ГодыВыпускаБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ЕдиницыИзмеренияСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассГруза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРесурсов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГруппыРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКДП2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводитьСтоимостьНаОбъем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonForms/СМ_ОбщиеНастройкиСмета/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	//  Общие настройки расчета НР и СП	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_ПоправочныйКоэффициентСПТекущий) Тогда
		НаборКонстант.СМ_ПоправочныйКоэффициентСПТекущий = 0.8;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_ПоправочныйКоэффициентСПБазисный) Тогда
		НаборКонстант.СМ_ПоправочныйКоэффициентСПБазисный= 1;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_ПоправочныйКоэффициентНРТекущий) Тогда
		НаборКонстант.СМ_ПоправочныйКоэффициентНРТекущий = 0.85;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_ПоправочныйКоэффициентНРБазисный) Тогда
		НаборКонстант.СМ_ПоправочныйКоэффициентНРБазисный = 1;
	КонецЕсли;
	
	// Округление НР и СП.
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_ОкруглятьНормативыНРиСП) Тогда
		НаборКонстант.СМ_ОкруглятьНормативыНРиСП = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_ОкруглятьНормативыНРиСПбазис) Тогда
		НаборКонстант.СМ_ОкруглятьНормативыНРиСПбазис = Ложь;
	КонецЕсли;
	
	//  Параметры расчета НР и СП при определении стоимости ремонтных работ 
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_КоэффициентНРбазисныйРемонт) Тогда
		НаборКонстант.СМ_КоэффициентНРбазисныйРемонт = 0.9;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_КоэффициентСПбазисныйРемонт) Тогда
		НаборКонстант.СМ_КоэффициентСПбазисныйРемонт = 0.85; 
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_КоэффициентНРтекущийРемонт) Тогда
		НаборКонстант.СМ_КоэффициентНРтекущийРемонт = 0.9; 
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_КоэффициентСПтекущийРемонт) Тогда
		НаборКонстант.СМ_КоэффициентСПтекущийРемонт = 0.85; 
	КонецЕсли;
	
	//  Параметры расчета НР и СП при упрощенной системе налогообложения 
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_КоэффициентНРбазисныйУСН) Тогда
		НаборКонстант.СМ_КоэффициентНРбазисныйУСН = 0.7;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_КоэффициентСПбазисныйУСН) Тогда
		НаборКонстант.СМ_КоэффициентСПбазисныйУСН = 0.9;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_КоэффициентНРтекущийУСН) Тогда
		НаборКонстант.СМ_КоэффициентНРтекущийУСН = 0.94; 
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_КоэффициентСПтекущийУСН) Тогда
		НаборКонстант.СМ_КоэффициентСПтекущийУСН = 0.9; 
	КонецЕсли;
	
	//  Параметры расчета НР и СП при реконструкции и капитальном ремонте АЭС 
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_КоэффициентНРбазисныйАЭС) Тогда
		НаборКонстант.СМ_КоэффициентНРбазисныйАЭС = 1.2;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_КоэффициентСПбазисныйАЭС) Тогда
		НаборКонстант.СМ_КоэффициентСПбазисныйАЭС = 1;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_КоэффициентНРтекущийАЭС) Тогда
		НаборКонстант.СМ_КоэффициентНРтекущийАЭС = 1.2;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_КоэффициентСПтекущийАЭС) Тогда
		НаборКонстант.СМ_КоэффициентСПтекущийАЭС = 1;
	КонецЕсли;
	
	//  Расчет стоимости вспомогательных материалов для ресурсного метода
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_ПроцентДляТЕРм) Тогда
		НаборКонстант.СМ_ПроцентДляТЕРм = 2; 
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_ПроцентДляТЕРмр) Тогда
		НаборКонстант.СМ_ПроцентДляТЕРмр = 3;
	КонецЕсли;
	
	НайденныйРесурс = Справочники.СМ_Ресурсы.НайтиПоКоду("999-9950");
	Если НаборКонстант.СМ_ВспомогательныеМатериалы = Справочники.СМ_Ресурсы.ПустаяСсылка() Тогда
		НаборКонстант.СМ_ВспомогательныеМатериалы = НайденныйРесурс;
	КонецЕсли;

	//  Расчет затрат на уплату НДС при УСН

	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_УдВесМатерНР) Тогда
		НаборКонстант.СМ_УдВесМатерНР = 0.1712; 
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_УдВесМатерСП) Тогда
		НаборКонстант.СМ_УдВесМатерСП = 0.15; 
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_УдВесМатерНРКС) Тогда
		НаборКонстант.СМ_УдВесМатерНРКС = 0.182; 
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_НДСусн) Тогда
		НаборКонстант.СМ_НДСусн = 18; 
	КонецЕсли;
	
	// СЛК.
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_СерверСистемыЗащиты) Тогда
		НаборКонстант.СМ_СерверСистемыЗащиты = "Localhost"; 
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.СМ_ПортСистемыЗащиты) Тогда
		НаборКонстант.СМ_ПортСистемыЗащиты = 9099; 
	КонецЕсли;
	
	МетодикаМДС35					= ПолучитьФункциональнуюОпцию("СМ_МетодикаМДС35");
	МетодикаТСН 					= ПолучитьФункциональнуюОпцию("СМ_МетодикаТСНГородаМосква");
	Методика1984года 				= ПолучитьФункциональнуюОпцию("СМ_Методика84Года");

	Элементы.МетодикаТСН.Видимость 	= МетодикаТСН;
	Элементы.Группа1984.Видимость 	= Методика1984года;
	Элементы.ГруппаСЛК.Видимость 	= Не ПолучитьФункциональнуюОпцию("СМ_БазоваяВерсия");	 
	
	Если Методика1984года Тогда
		Выборка = РегистрыСведений.СМ_НаборКонстантпоМетодике1984.Получить();
		СтрокаПараметра = Параметры1984.Добавить();
		СтрокаПараметра.НакладныеРасходыРесурсные = Выборка.НакладныерасходыРесурсные; 	
		Если НЕ ЗначениеЗаполнено(СтрокаПараметра.НакладныеРасходыРесурсные) Тогда
			СтрокаПараметра.НакладныеРасходыРесурсные = 11.7;
		КонецЕсли;
		СтрокаПараметра.СметнаяПрибыльБазисноИндексная = Выборка.СметнаяПрибыльБазисноИндексная; 	
		Если НЕ ЗначениеЗаполнено(СтрокаПараметра.СметнаяПрибыльБазисноИндексная) Тогда
			СтрокаПараметра.СметнаяПрибыльБазисноИндексная = 8;
		КонецЕсли;
		СтрокаПараметра.СметнаяПрибыльРесурсная = Выборка.СметнаяПрибыльРесурсная; 	
		Если НЕ ЗначениеЗаполнено(СтрокаПараметра.СметнаяПрибыльРесурсная) Тогда
			СтрокаПараметра.СметнаяПрибыльРесурсная = 12;
		КонецЕсли;
		СтрокаПараметра.КоэффициентТРвНР = Выборка.КоэффициентТРвНР; 	
		Если НЕ ЗначениеЗаполнено(СтрокаПараметра.КоэффициентТРвНР) Тогда
			СтрокаПараметра.КоэффициентТРвНР = 0.092;
		КонецЕсли;
		СтрокаПараметра.КоэффициентОЗвНР = Выборка.КоэффициентОЗвНР; 	
		Если НЕ ЗначениеЗаполнено(СтрокаПараметра.КоэффициентОЗвНР) Тогда
			СтрокаПараметра.КоэффициентОЗвНР = 0.180;
		КонецЕсли;
		СтрокаПараметра.НРБазисныеОтФОТ = Выборка.НРБазисныеОтФОТ; 	
		Если НЕ ЗначениеЗаполнено(СтрокаПараметра.НРБазисныеОтФОТ) Тогда
			СтрокаПараметра.НРБазисныеОтФОТ = 80;
		КонецЕсли;
		СтрокаПараметра.НРТекущиеОтФОТ = Выборка.НРТекущиеОтФОТ; 	
		Если НЕ ЗначениеЗаполнено(СтрокаПараметра.НРТекущиеОтФОТ) Тогда
			СтрокаПараметра.НРТекущиеОтФОТ = 80;
		КонецЕсли;
		СтрокаПараметра.СПБазисныеОтФОТ = Выборка.СПБазисныеОтФОТ; 	
		Если НЕ ЗначениеЗаполнено(СтрокаПараметра.СПБазисныеОтФОТ) Тогда
			СтрокаПараметра.СПБазисныеОтФОТ = 50;
		КонецЕсли;
		СтрокаПараметра.СПТекущиеОтФОТ = Выборка.СПТекущиеОтФОТ; 	
		Если НЕ ЗначениеЗаполнено(СтрокаПараметра.СПТекущиеОтФОТ) Тогда
			СтрокаПараметра.СПТекущиеОтФОТ = 50;
		КонецЕсли;
		СтрокаПараметра.КоэффициентПереходаОтОЗкЗТРмонтажные = Выборка.КоэффициентПереходаОтОЗкЗТРмонтажные; 	
		Если НЕ ЗначениеЗаполнено(СтрокаПараметра.КоэффициентПереходаОтОЗкЗТРмонтажные) Тогда
			СтрокаПараметра.КоэффициентПереходаОтОЗкЗТРмонтажные = 1;
		КонецЕсли;
		СтрокаПараметра.КоэффициентПереходаОтОЗкЗТР = Выборка.КоэффициентПереходаОтОЗкЗТР; 	
		Если НЕ ЗначениеЗаполнено(СтрокаПараметра.КоэффициентПереходаОтОЗкЗТР) Тогда
			СтрокаПараметра.КоэффициентПереходаОтОЗкЗТР = 1;
		КонецЕсли;
		СтрокаПараметра.КоэффициентПереходаОтЗМкЗТМЗемляные = Выборка.КоэффициентПереходаОтЗМкЗТМЗемляные; 	
		Если НЕ ЗначениеЗаполнено(СтрокаПараметра.КоэффициентПереходаОтЗМкЗТМЗемляные) Тогда
			СтрокаПараметра.КоэффициентПереходаОтЗМкЗТМЗемляные = 1.44;
		КонецЕсли;
		СтрокаПараметра.КоэффициентПереходаОтЗМкЗТМ = Выборка.КоэффициентПереходаОтЗМкЗТМ; 	
		Если НЕ ЗначениеЗаполнено(СтрокаПараметра.КоэффициентПереходаОтЗМкЗТМ) Тогда
			СтрокаПараметра.КоэффициентПереходаОтЗМкЗТМ = 1.29;
		КонецЕсли;
	КонецЕсли;
	
	СМ_ИспользоватьСтатусыДокументов 					= Константы.СМ_ИспользоватьСтатусыДокументов.Получить();
	СМ_ИспользоватьЗаявкиСнабжения						= Константы.СМ_ИспользоватьЗаявкиСнабжения.Получить();
	СМ_MSP_ИспользоватьИнтеграциюMSP					= Константы.СМ_MSP_ИспользоватьИнтеграциюMSP.Получить();
	СМ_РазрешитьРедактированиеЗакрытыхСмет 				= Константы.СМ_РазрешитьРедактированиеЗакрытыхСмет.Получить();
	СМ_ИспользоватьЛимитированныеЗатратыПодчиненныхСмет = Константы.СМ_ИспользоватьЛимитированныеЗатратыПодчиненныхСмет.Получить();
	СМ_ИспользоватьРасчетСреднейСтоимости 				= Константы.СМ_ИспользоватьРасчетСреднейСтоимости.Получить();
	СМ_WS_ИспользоватьИнтеграцию						= Константы.СМ_WS_ИспользоватьИнтеграцию.Получить();
	СМ_ЗапртетитьВставкуПозицийРесурсов                 = Константы.СМ_ЗапртетитьВставкуПозицийРесурсов.Получить();
	
	Элементы.ОбработкаСМ_MSP_НастройкаСинхронизацииОткрыть.Доступность 	= СМ_MSP_ИспользоватьИнтеграциюMSP;
	Элементы.ОбработкаСМ_WS_ИнтеграцияВебСервисИнтеграцияБП.Доступность = СМ_WS_ИспользоватьИнтеграцию;

КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СписокСметныхПрограмм(Команда)
	ОткрытьФорму("Справочник.СМ_СметныеПрограммы.Форма.ФормаСписка");
КонецПроцедуры  

&НаКлиенте
Процедура НастройкаИтогов(Команда)
	ОткрытьФорму("РегистрСведений.СМ_АРПС_Итоги.Форма.ФормаСписка");
КонецПроцедуры  

&НаКлиенте
Процедура НастройкаЛимЗатрат(Команда)
	ОткрытьФорму("РегистрСведений.СМ_АРПС_СоответствияЛимЗатрат.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПрефиксов(Команда)
	ОткрытьФорму("РегистрСведений.СМ_АРПС_ПрефиксыОбъектов.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСоовтествийШифров(Команда)
	ОткрытьФорму("РегистрСведений.СМ_АРПС_СоответствияШифров.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура СтартСистемыЗащиты(Команда)
	// СМ_СметаКлиент.СметнаяПодсистемаПриЗапуске();
	 ОткрытьФорму("Обработка.слкМенеджерЛицензий.Форма");
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.СМ_ОтправлятьСведенияАРПС
		И ПланыОбмена.СМ_СервисАРПС.НайтиПоКоду("АРПС").Пустая() Тогда
		План = ПланыОбмена.СМ_СервисАРПС.СоздатьУзел();
		План.Код = "АРПС";
		План.Наименование = "АРПС";
		План.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Методика84года 	= НаборКонстант.СМ_Методика84года;
	МетодикаМДС35	= НаборКонстант.СМ_МетодикаТСНГородаМосква;
	МетодикаТСН		= НаборКонстант.СМ_МетодикаМДС35;

	Если НЕ Методика84года И НЕ МетодикаМДС35 И НЕ МетодикаТСН Тогда
	    Сообщение 		= Новый СообщениеПользователю();
	    Сообщение.Текст = "Не выбрана ни одна методика расчета";
	    Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	ТЗ 		= РеквизитФормыВЗначение("Параметры1984", Тип("ТаблицаЗначений")); 
	Записи 	= РегистрыСведений.СМ_НаборКонстантпоМетодике1984.СоздатьНаборЗаписей();
	Записи.Очистить();
	Записи.Загрузить(ТЗ);
	Записи.Записать(Истина);

КонецПроцедуры

&НаКлиенте
Процедура СМ_ИспользоватьСтатусыДокументовПриИзменении(Элемент)
	КонстантаДоИзменения = ПолучитьКонстанту("СМ_ИспользоватьСтатусыДокументов"); 
	ЕстьДокументы = ПроверитьДокументы();
	Если КонстантаДоИзменения И ЕстьДокументы Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Выключение параметра приведет к потере статусов у уже созданных документов. Продолжить?';"
		+ " en = 'Do you want to continue?'"), Режим, 0);
	Иначе
		УстановитьКонстанту(СМ_ИспользоватьСтатусыДокументов,"СМ_ИспользоватьСтатусыДокументов");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СМ_ИспользоватьЗаявкиСнабженияПриИзменении(Элемент)
	УстановитьКонстанту(СМ_ИспользоватьЗаявкиСнабжения,"СМ_ИспользоватьЗаявкиСнабжения");
КонецПроцедуры

&НаСервере
Функция ПолучитьКонстанту(ИмяКонстанты)
    Возврат Константы[ИмяКонстанты].Получить();
КонецФункции

&НаСервере
Функция ПроверитьДокументы()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СМ_ЛокальнаяСмета.Ссылка
	               |ИЗ
	               |	Документ.СМ_ЛокальнаяСмета КАК СМ_ЛокальнаяСмета
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СМ_АктВыполненныхРабот.Ссылка
	               |ИЗ
	               |	Документ.СМ_АктВыполненныхРабот КАК СМ_АктВыполненныхРабот";
	Результат = Запрос.Выполнить();
    Возврат Не Результат.Пустой();
КонецФункции

&НаСервере
Процедура УстановитьКонстанту(Значение,ИмяКонстанты)
    Константы[ИмяКонстанты].Установить(Значение);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		СМ_ИспользоватьСтатусыДокументов = Истина;
        Возврат;
	КонецЕсли;
	УстановитьКонстанту(Ложь,"СМ_ИспользоватьСтатусыДокументов");
	Состояние(НСтр("ru = 'Идет установка статуса документов!'"),50);
	СМ_СметаВызовСервера.УстановитьСтатусСогласовано();
	Состояние(НСтр("ru = 'Установка статуса документов завершена!'"),100);
КонецПроцедуры

&НаКлиенте
Процедура СМ_ИспользоватьИнтеграциюMSPПриИзменении(Элемент)
	УстановитьКонстанту(СМ_MSP_ИспользоватьИнтеграциюMSP,"СМ_MSP_ИспользоватьИнтеграциюMSP");
	Элементы.ОбработкаСМ_MSP_НастройкаСинхронизацииОткрыть.Доступность = СМ_MSP_ИспользоватьИнтеграциюMSP;
КонецПроцедуры

&НаКлиенте
Процедура СМ_ХранитьИсториюИзмененияСметПриИзменении(Элемент)
	Элементы.НастроитьХранениеИстории.Видимость = Не Элементы.НастроитьХранениеИстории.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаХраненияИстории(Команда)
	
	// Создание структуры значений
	СтруктураФормы = Новый Структура;
	СтруктураФормы.Вставить("ТипОбъекта",	"СМЕТА");

	// Почему-то нужно создавать запись через массив (по другому не взлетало)
	МассивКлюча = Новый Массив;
	МассивКлюча.Добавить(СтруктураФормы);
	
	// Создание ключа записи регистра сведений
	КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.СМ_НастройкиВерсионированияОбъектов", МассивКлюча);
	
	// Структура ключа записи для поиска при открытии
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Ключ", КлючЗаписи);
	
	// Если запись не будет найдена, вызовем заполнение измерений.
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("ЗначенияЗаполнения", СтруктураФормы);
	
	Попытка
		// Попытка открытия формы записи
		ОткрытьФорму("РегистрСведений.СМ_НастройкиВерсионированияОбъектов.Форма.НастройкаХранения", СтруктураКлюча, ЭтаФорма);
	Исключение
		// В исключение ушло если запись не найдена.
		ОписаниеОшибки = ОписаниеОшибки();
		Если Найти(ОписаниеОшибки, "Объект не найден") Тогда
			// Запись не найдена. Откроем форму и заполнением по структуре.
			ОткрытьФорму("РегистрСведений.СМ_НастройкиВерсионированияОбъектов.Форма.НастройкаХранения", СтруктураЗаполнения, ЭтаФорма);
		КонецЕсли;
	КонецПопытки;   
КонецПроцедуры

&НаКлиенте
Процедура СМ_РазрешитьРедактированиеЗакрытыхСметПриИзменении(Элемент)
	КонстантаДоИзменения = ПолучитьКонстанту("СМ_РазрешитьРедактированиеЗакрытыхСмет"); 
	Если Не КонстантаДоИзменения Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗакрытыхСмет", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Данная опция может привести к расхождению между плановыми и фактическими показателями. Вы точно хотите включить возможность?';"
		+ " en = 'Do you want to continue?'"), Режим, 0);
	Иначе
		УстановитьКонстанту(СМ_РазрешитьРедактированиеЗакрытыхСмет,"СМ_РазрешитьРедактированиеЗакрытыхСмет");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаЗакрытыхСмет(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		СМ_РазрешитьРедактированиеЗакрытыхСмет = Ложь;
        Возврат;
	КонецЕсли;
	УстановитьКонстанту(Истина,"СМ_РазрешитьРедактированиеЗакрытыхСмет");
КонецПроцедуры

&НаКлиенте
Процедура СМ_ИспользоватьЛимитированныеЗатратыПодчиненныхСметПриИзменении(Элемент)
	КонстантаДоИзменения = ПолучитьКонстанту("СМ_ИспользоватьЛимитированныеЗатратыПодчиненныхСмет"); 
	ЕстьДокументы = ПроверитьДокументы();
	Если ЕстьДокументы Тогда
		ПоказатьПредупреждение(,НСтр("ru= 'Внимание! В системе уже имеются документы! Их необходимо пересчитать вручную. До момента пересчета итоги будут не корректными.'"));
		УстановитьКонстанту(СМ_ИспользоватьЛимитированныеЗатратыПодчиненныхСмет,"СМ_ИспользоватьЛимитированныеЗатратыПодчиненныхСмет");
	Иначе
		УстановитьКонстанту(СМ_ИспользоватьЛимитированныеЗатратыПодчиненныхСмет,"СМ_ИспользоватьЛимитированныеЗатратыПодчиненныхСмет");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СМ_ИспользоватьРасчетСреднейСтоимостиПриИзменении(Элемент)
	КонстантаДоИзменения = ПолучитьКонстанту("СМ_ИспользоватьРасчетСреднейСтоимости"); 
	ЕстьДокументы = ПроверитьДокументы();
	Если ЕстьДокументы Тогда
		ПоказатьПредупреждение(,НСтр("ru= 'Внимание! В системе уже имеются документы! Их необходимо пересчитать вручную. До момента пересчета итоги по текущей стоимости будут не корректными.'"));
		УстановитьКонстанту(СМ_ИспользоватьРасчетСреднейСтоимости,"СМ_ИспользоватьРасчетСреднейСтоимости");
	Иначе
		УстановитьКонстанту(СМ_ИспользоватьРасчетСреднейСтоимости,"СМ_ИспользоватьРасчетСреднейСтоимости");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СМ_WS_ИспользоватьИнтеграциюБППриИзменении(Элемент)
	УстановитьКонстанту(СМ_WS_ИспользоватьИнтеграцию,"СМ_WS_ИспользоватьИнтеграцию");
	Элементы.ОбработкаСМ_WS_ИнтеграцияВебСервисИнтеграцияБП.Доступность = СМ_WS_ИспользоватьИнтеграцию;
КонецПроцедуры

&НаКлиенте
Процедура СМ_Методика84годаПриИзменении(Элемент)
	
	Элементы.Группа1984.Видимость = НаборКонстант.СМ_Методика84года;

КонецПроцедуры

&НаКлиенте
Процедура СМ_МетодикаТСНГородаМоскваПриИзменении(Элемент)
	
	Элементы.МетодикаТСН.Видимость 	= НаборКонстант.СМ_МетодикаТСНГородаМосква;

КонецПроцедуры

&НаКлиенте
Процедура СМ_ЗапртетитьВставкуПозицийРесурсовПриИзменении(Элемент)
	УстановитьКонстанту(СМ_ЗапртетитьВставкуПозицийРесурсов,"СМ_ЗапртетитьВставкуПозицийРесурсов");
КонецПроцедуры

#КонецОбласти
